<?php
//translated
$this->db->query("INSERT INTO ".$this->db->table('stock_statuses')." (`stock_status_id`, `language_id`, `name`)
VALUES
('1', ".$newLanguageId.", 'Προ-παραγγελία')");


$this->db->query("INSERT INTO ".$this->db->table('length_class_descriptions')." (`length_class_id`, `language_id`, `title`, `unit`)
VALUES
('1', ".$newLanguageId.", 'Εκατοστό', 'cm'),
('2', ".$newLanguageId.", 'Χιλιοστό', 'mm'),
('3', ".$newLanguageId.", 'Ίντσα', 'σε')");


$this->db->query("INSERT INTO ".$this->db->table('weight_class_descriptions')." (`weight_class_id`, `language_id`, `title`, `unit`)
VALUES
('1', ".$newLanguageId.", 'χιλιόγραμμο', 'κιλό'),
('2', ".$newLanguageId.", 'Γραμμάριο', 'γ'),
('5', ".$newLanguageId.", 'Λίρα', 'λίβρα'),
('6', ".$newLanguageId.", 'Ουγγιά', 'ουγκιά')");


$this->db->query("INSERT INTO ".$this->db->table('order_statuses')." (`order_status_id`, `language_id`, `name`)
VALUES
('0', ".$newLanguageId.", 'Ελλιπές'),
('1', ".$newLanguageId.", 'Εκκρεμής'),
('2', ".$newLanguageId.", 'Επεξεργασία'),
('3', ".$newLanguageId.", 'Απεστάλη'),
('5', ".$newLanguageId.", 'Ολοκληρώθηκε'),
('7', ".$newLanguageId.", 'Ακυρώθηκε'),
('8', ".$newLanguageId.", 'Απορρίφθηκε'),
('9', ".$newLanguageId.", 'Ακυρωμένη Αναστροφή'),
('10', ".$newLanguageId.", 'Απέτυχε'),
('11', ".$newLanguageId.", 'Επιστράφηκε'),
('12', ".$newLanguageId.", 'Αναστραμμένο'),
('13', ".$newLanguageId.", 'Αντιστροφή χρέωσης'),
('14', ".$newLanguageId.", 'Ακυρώθηκε από τον πελάτη')");


$this->db->query("INSERT INTO ".$this->db->table('page_descriptions')." (`page_id`, `language_id`, `name`, `title`, `seo_url`, `keywords`, `description`, `content`)
VALUES
('1', ".$newLanguageId.", 'Όλες οι άλλες σελίδες', '', '', '', '', ''),
('2', ".$newLanguageId.", 'Αρχική Σελίδα', '', '', '', '', ''),
('3', ".$newLanguageId.", 'Σελίδα σύνδεσης', '', '', '', '', ''),
('4', ".$newLanguageId.", 'Σελίδα Επικοινωνίας', '', '', '', '', ''),
('5', ".$newLanguageId.", 'Προκαθορισμένη σελίδα προϊόντος', '', '', '', '', ''),
('7', ".$newLanguageId.", 'Σελίδα Συντήρησης', '', '', '', '', ''),
('8', ".$newLanguageId.", 'Πίνακας Ελέγχου Πελάτη', '', '', '', '', ''),
('9', ".$newLanguageId.", 'Στοιχεία λογαριασμού', '', '', '', '', ''),
('10', ".$newLanguageId.", 'Αλλαγή Κωδικού', '', '', '', '', ''),
('11', ".$newLanguageId.", 'Διευθύνσεις', '', '', '', '', ''),
('12', ".$newLanguageId.", 'Λίστα Επιθυμιών', '', '', '', '', ''),
('13', ".$newLanguageId.", 'Ιστορικό Παραγγελιών', '', '', '', '', ''),
('14', ".$newLanguageId.", 'Ιστορικό Συναλλαγών', '', '', '', '', ''),
('15', ".$newLanguageId.", 'Λήψεις', '', '', '', '', ''),
('16', ".$newLanguageId.", 'Ειδοποιήσεις', '', '', '', '', ''),
('17', ".$newLanguageId.", 'Σελίδα Καλαθιού', '', '', '', '', ''),
('18', ".$newLanguageId.", 'Σελίδα Γρήγορης Ολοκλήρωσης Παραγγελίας', '', '', '', '', ''),
('19', ".$newLanguageId.", 'Σελίδα επιτυχίας γρήγορης ολοκλήρωσης παραγγελίας', '', '', '', '', ''),
('20', ".$newLanguageId.", 'Προκαθορισμένη Σελίδα Περιεχομένου', '', '', '', '', '')");


$this->db->query("INSERT INTO ".$this->db->table('global_attributes_type_descriptions')." (`attribute_type_id`, `language_id`, `type_name`)
VALUES
('1', ".$newLanguageId.", 'Επιλογή Προϊόντος'),
('2', ".$newLanguageId.", 'Χαρακτηριστικό Λήψης')");


$this->db->query("INSERT INTO ".$this->db->table('form_descriptions')." (`form_id`, `language_id`, `description`)
VALUES
('2', ".$newLanguageId.", 'Φόρμα Επικοινωνίας'),
('4', ".$newLanguageId.", 'Φόρμα Διεύθυνσης Πελάτη'),
('5', ".$newLanguageId.", 'Φόρμα Διεύθυνσης και Στοιχείων Επισκέπτη'),
('6', ".$newLanguageId.", 'Φόρμα Στοιχείων Πελάτη'),
('7', ".$newLanguageId.", 'Φόρμα Εγγραφής Πελάτη')");


$this->db->query("INSERT INTO ".$this->db->table('field_descriptions')." (`field_id`, `name`, `description`, `language_id`, `error_text`)
VALUES
('11', 'Όνομα:', '', ".$newLanguageId.", 'Το όνομα πρέπει να αποτελείται από 3 έως 32 χαρακτήρες!'),
('12', 'Ηλεκτρονικό Ταχυδρομείο:', '', ".$newLanguageId.", 'Η διεύθυνση ηλεκτρονικού ταχυδρομείου δεν φαίνεται να είναι έγκυρη!'),
('13', 'Ερώτηση:', '', ".$newLanguageId.", 'Το ερώτημα πρέπει να είναι μεταξύ 10 και 3000 χαρακτήρων!'),
('14', 'Εισάγετε τον κωδικό στο παρακάτω πεδίο:', '', ".$newLanguageId.", 'Η επαλήθευση ανθρώπου απέτυχε! Παρακαλώ δοκιμάστε ξανά.'),
('16', 'χώρες', '', ".$newLanguageId.", ''),
('18', 'Αριθμός ΦΠΑ', '', ".$newLanguageId.", ''),
('19', 'Χώρα', '', ".$newLanguageId.", 'Παρακαλώ επιλέξτε μια χώρα!'),
('20', 'Ζώνη', '', ".$newLanguageId.", 'Παρακαλώ επιλέξτε μια περιοχή/πολιτεία!'),
('21', 'Εταιρεία', '', ".$newLanguageId.", 'Το όνομα της εταιρείας πρέπει να είναι μικρότερο από 32 χαρακτήρες!'),
('22', 'Γραμμή διεύθυνσης 1', '', ".$newLanguageId.", 'Η γραμμή διεύθυνσης 1 πρέπει να έχει μήκος από 3 έως 128 χαρακτήρες!'),
('23', 'Γραμμή διεύθυνσης 2', '', ".$newLanguageId.", 'Η 2η γραμμή διεύθυνσης πρέπει να έχει λιγότερους από 128 χαρακτήρες!'),
('24', 'Πόλη', '', ".$newLanguageId.", 'Η πόλη πρέπει να έχει μήκος μεταξύ 3 και 128 χαρακτήρων!'),
('25', 'Ταχυδρομικός Κώδικας', '', ".$newLanguageId.", 'Ταχυδρομικός Κωδικός/Ταχυδρομικός Κωδικός πρέπει να είναι μικρότερος από 11 χαρακτήρες!'),
('26', 'Όνομα', '', ".$newLanguageId.", 'Το όνομα πρέπει να είναι μεταξύ 1 και 32 χαρακτήρων!'),
('27', 'Επώνυμο', '', ".$newLanguageId.", 'Το επώνυμο πρέπει να είναι μεταξύ 1 και 32 χαρακτήρων!'),
('29', 'Προεπιλεγμένη Διεύθυνση', '', ".$newLanguageId.", ''),
('30', 'ΑΦΜ', '', ".$newLanguageId.", 'Ο Κωδικός VAT ID πρέπει να είναι μεταξύ 8 και 14 χαρακτήρων!'),
('31', 'Χώρα', '', ".$newLanguageId.", 'Παρακαλώ επιλέξτε μια χώρα!'),
('32', 'Περιοχή/Πολιτεία', '', ".$newLanguageId.", 'Παρακαλώ επιλέξτε περιοχή/κράτος!'),
('33', 'Εταιρεία', '', ".$newLanguageId.", 'Το όνομα εταιρείας πρέπει να είναι μικρότερο από 32 χαρακτήρες!'),
('34', 'Γραμμή διεύθυνσης 1', '', ".$newLanguageId.", 'Η γραμμή διεύθυνσης 1 πρέπει να είναι μεταξύ 3 και 128 χαρακτήρων!'),
('35', 'Γραμμή διεύθυνσης 2', '', ".$newLanguageId.", 'Η Γραμμή Διεύθυνσης 2 πρέπει να έχει λιγότερους από 128 χαρακτήρες!'),
('36', 'Πόλη', '', ".$newLanguageId.", 'Η πόλη πρέπει να έχει μήκος από 3 έως 128 χαρακτήρες!'),
('37', 'Ταχ. Κωδικός/Ταχυδρομικός Κώδικας', '', ".$newLanguageId.", 'Ταχυδρομικός κώδικας/Ταχυδρομικός κώδικας πρέπει να είναι λιγότεροι από 11 χαρακτήρες!'),
('38', 'Όνομα', '', ".$newLanguageId.", 'Το Όνομα πρέπει να είναι από 1 έως 32 χαρακτήρες!'),
('39', 'Επώνυμο', '', ".$newLanguageId.", 'Το επώνυμο πρέπει να είναι μεταξύ 1 και 32 χαρακτήρων!'),
('40', 'ΑΦΜ', '', ".$newLanguageId.", 'Ο κωδικός VAT ID πρέπει να αποτελείται από 8 έως 14 χαρακτήρες!'),
('41', 'Ηλεκτρονικό ταχυδρομείο', '', ".$newLanguageId.", 'Το email σας δεν έχει παρασχεθεί ή είναι άκυρο!'),
('42', 'Αριθμός τηλεφώνου', '', ".$newLanguageId.", 'Ο αριθμός τηλεφώνου επικοινωνίας σας δεν παρέχεται ή είναι άκυρος.'),
('43', 'Όνομα σύνδεσης', '', ".$newLanguageId.", 'Το όνομα σύνδεσης πρέπει να έχει μήκος μεταξύ 5 και 65 χαρακτήρων!'),
('44', 'Όνομα', '', ".$newLanguageId.", 'Το όνομα πρέπει να έχει μήκος από 1 έως 32 χαρακτήρες!'),
('45', 'Επώνυμο', '', ".$newLanguageId.", 'Το επώνυμο πρέπει να έχει μήκος από 1 έως 32 χαρακτήρες!'),
('46', 'Ηλεκτρονικό ταχυδρομείο', '', ".$newLanguageId.", 'Το email σας δεν έχει δοθεί ή είναι άκυρο!'),
('47', 'Αριθμός τηλεφώνου', '', ".$newLanguageId.", 'Ο αριθμός τηλεφώνου επικοινωνίας σας δεν έχει δοθεί ή είναι άκυρος.'),
('49', 'Όνομα', '', ".$newLanguageId.", 'Το όνομα πρέπει να έχει μήκος από 1 έως 32 χαρακτήρες!'),
('50', 'Επώνυμο', '', ".$newLanguageId.", 'Το επώνυμο πρέπει να είναι μεταξύ 1 και 32 χαρακτήρων!'),
('51', 'Ηλεκτρονικό ταχυδρομείο', '', ".$newLanguageId.", 'Το email σας δεν παρέχεται ή είναι άκυρο!'),
('52', 'Αριθμός Τηλεφώνου', '', ".$newLanguageId.", 'Ο αριθμός τηλεφώνου επικοινωνίας σας δεν έχει δοθεί ή είναι άκυρος.'),
('53', 'Χώρα', '', ".$newLanguageId.", 'Παρακαλώ επιλέξτε μια χώρα!'),
('54', 'Περιφέρεια/Πολιτεία', '', ".$newLanguageId.", 'Παρακαλώ επιλέξτε μια περιοχή/πολιτεία!'),
('55', 'Διεύθυνση Γραμμή 1', '', ".$newLanguageId.", 'Η Γραμμή Διεύθυνσης 1 πρέπει να έχει μήκος μεταξύ 3 και 128 χαρακτήρων!'),
('56', 'Γραμμή διεύθυνσης 2', '', ".$newLanguageId.", 'Η Γραμμή διεύθυνσης 2 πρέπει να περιέχει λιγότερους από 128 χαρακτήρες!'),
('57', 'Πόλη', '', ".$newLanguageId.", 'Η πόλη πρέπει να είναι μεταξύ 3 και 128 χαρακτήρων!'),
('58', 'Ταχυδρομικός Κώδικας/Ταχυδρομικός Κώδικας', '', ".$newLanguageId.", 'Ταχυδρομικός/Ταχυδρομικός Κώδικας πρέπει να είναι μικρότερος από 11 χαρακτήρες!'),
('59', 'Εταιρεία', '', ".$newLanguageId.", 'Το όνομα της εταιρείας πρέπει να έχει λιγότερους από 32 χαρακτήρες!'),
('60', 'Όνομα σύνδεσης', '', ".$newLanguageId.", 'Το όνομα χρήστη πρέπει να είναι μόνο αλφαριθμητικό και να έχει μήκος από 5 έως 64 χαρακτήρες!'),
('61', 'Εγγραφείτε', '', ".$newLanguageId.", ''),
('62', 'Αριθμός ΦΠΑ', '', ".$newLanguageId.", 'Ο κωδικός ΦΠΑ πρέπει να έχει μήκος από 8 έως 14 χαρακτήρες!')");


